<?php
/********************************************************************
                             Class Console
********************************************************************/
class Console
{
    /*---------------------------------------------------------------
     * DRYRUNモードならtrueを返す。
     * ※ オプションに --run が指定されている場合falseを返す
     --------------------------------------------------------------*/
    public static function isDryRunMode(){
        static $ret = null;
        if (is_null($ret)) {
            $opt = getopt('', array('run'));
            $ret = !isset($opt['run']);
        }
        return $ret;
    }


    /*---------------------------------------------------------------
     * 標準入力から整数値を受け取る
     * 無効な入力の場合nullを返す。
     --------------------------------------------------------------*/
    public static function getNumber(){
        fscanf(STDIN, "%d\n", $number); // STDIN から数値を読み込む
        return $number;
    }

    /*---------------------------------------------------------------
     * 標準入力から一行分の文字列を受け取る ※改行コードは含まれない
     --------------------------------------------------------------*/
    public static function getString() {
        return trim(fgets(STDIN,4096));
    }

}// End of Class

